# Pandas?
- Excel과 유사
- python에서 엑셀과 같이 데이터들을 정리하고 분석하는 Tool

In [6]:
# numpy 라이브러리 및 pandas 라이브러리 불러오기
import numpy as np
import pandas as pd

## 딕셔너리 -> DataFram 변환
- pandas.DAtaFrame(딕셔너리 객체)

In [7]:
# 열이름을 key로하고, 리스트를 value로 갖는 딕셔너리 정의(2차원 배열)
dict_data = {'c0': [1, 2, 3], 'c1': [4, 5, 6], 
             'c2': [7, 8 ,9], 'c3': [10, 11, 12], 
             'c4': [13, 14, 15]}

# 판다스 DataFrame() 함수로 딕셔너리를 데이터프레임으로 변환. 변수 df에 저장
df = pd.DataFrame(dict_data)

In [8]:
# df의 자료형 출력
type(df)

pandas.core.frame.DataFrame

In [9]:
# 변수 df에 저장되어 있는 데이터프레임 객체를 출력
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

## 행/열 조작하기
- 행 인덱스 변경: DataFrame 객체.index = 새로운 행 인덱스 배열
- 열 이름 변경: DataFrame 객체.columns = 새로운 열 이름 배열

In [10]:
# 행 인덱스/열 이름 지정하여 데이터프레임 만들기
# 딕셔너리 방법이 아닌, 리스트를 이용한 방법
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']],
									index=['준서', '예은'],
									columns=['나이', '성별', '학교'])

df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [11]:
# 행 인덱스, 열 이름 변경하기
df.index = ['학생1', '학생2']
df.columns = ['연령', '남녀', '소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

## 행/열 삭제
- 행 삭제: DataFrame 객체.drop(행 인덱스 또는 배열, axis = 0)

- 열 삭제: DataFrame 객체.drop(열 이름 또는 배열, axis = 1)

In [24]:
# 두 개 이상의 행(튜플)을 삭제하고 싶은 경우 배열(리스트) 형태로 넣어주면 됨.
df = pd.DataFrame([[90, 98, 85, 100],
                 [80, 89, 95, 90],
                 [70, 95, 100, 90]],
                 index=['서준', '우현', '인아'],
                 columns=['수학', '영어', '음악', '체육'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [16]:
df.drop('우현', inplace=True)
df

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [20]:
df.drop(['우현', '인아'], axis=0, inplace=True)
df

    수학  영어  음악   체육
서준  90  98  85  100

In [23]:
df.drop('수학', axis=1, inplace=True)
df

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [25]:
df.drop(['영어', '음악'], axis=1, inplace=True)
df

    수학   체육
서준  90  100
우현  80   90
인아  70   90

## 행 선택

In [28]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
# 딕셔너리 방법을 이용
exam_data = {'수학' : [90, 80, 70], '영어' : [98, 89, 95],
						 '음악' : [85, 95 ,100], '체육' : [100, 90, 90]}

# 인덱스 이름을 지정하여 데이터 프레임 생성
df  = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [33]:
# 행 인덱스를 사용하여 행 1개 선택
labell = df.loc['서준']
position1 = df.iloc[0]

print(labell)
print(position1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

## 행/열, transpose() 추가
- 행 추가: DataFrame.loc[ ‘새로운 행 이름’ ] = 데이터 값 (또는 배열)
- 열 추가: DataFrame 객체[ ‘추가하려는 열 이름’ ] = 데이터 값
- 행, 열 바꾸기: DataFrame 객체.transpose() 또는 DataFrame 객체.T

In [31]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'수학' : [90, 80, 70], '영어' : [98, 89, 95],
						 '음악' : [85, 95 ,100], '체육' : [100, 90, 90]}

df  = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [32]:
# 행 인덱스를 사용하여 행 1개 선택
labell = df.loc['서준']
position1 = df.iloc[0]

print(labell)
print(position1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [34]:
# 행 추가
df.loc['묭동이'] = [100, 100, 100, 100]

# 열 추가
df['국어'] = [88, 92, 78, 100]

df

      수학   영어   음악   체육   국어
서준    90   98   85  100   88
우현    80   89   95   90   92
인아    70   95  100   90   78
묭동이  100  100  100  100  100